{
    "Classes": [
        {
            "_id": "metabolizer",
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer",
                "Normal Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "definition": "Genes involved in the active metabolism of an adminstered treatment",
            "fullname": "Metabolizer"
        },
        {
            "_id": "immune",
            "classes": [
                "High Risk",
                "Low Risk"
            ],
            "definition": "Genes involved in immune response to specific treatments",
            "fullname": "Immune System"
        },
        {
            "_id": "predictor",
            "classes": [
                "Favorable Response",
                "Unfavorable Response"
            ],
            "definition": "Genes Which can help predict patient response outcome",
            "fullname": "Predictor of Response"
        },
        {
            "_id": "transporter",
            "classes": [
                "Normal Transporter Activity",
                "Intermediate Transporter Activity",
                "Poor Transporter Activity"
            ],
            "definition": "Genes involved in the movement of drugs and molecules within the body",
            "fullname": "Transporter"
        },
        {
            "_id": "catalyzer",
            "classes": [
                "Low Activity",
                "Intermediate Activity",
                "High Activity"
            ],
            "definition": "Catalyzes the metabolic processes",
            "fullname": "Catalyzer"
        }
    ],
    "Future": [
        {
            "class": "High Risk",
            "gene": "HLA-B*57:01",
            "rec": "Patient should avoid use of abacavir due to significantly increased risk to develop abacavir induced hypersensitivity reactions."
        },
        {
            "class": "Low Risk",
            "gene": "HLA-B*57:01",
            "rec": "Patient has normal population risk to develop abacavir induced hypersensitivity reactions."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "CYP2C9",
            "rec": "Patient metabolizes CYP2C9 substrate drugs (e.g. celecoxib, phenytoin) as expected. Drug therapies can be initiated per standard dosing guidelines."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "CYP2C9",
            "rec": "Patient has reduced metabolism of CYP2C9 substrate drugs, leading to an increased risk of adverse drug reactions (e.g.  phenytoin). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "CYP2C9",
            "rec": "Patient has reduced to no ability to metabolize CYP2C9 subtrate drugs (e.g. celecoxib, phenytoin), leading to an increased risk of adverse drug reactions. Be aware of potential need for dose adjustments."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "VKORC1",
            "rec": "Patient expected VKORC1 activity and Vitamin K levels are in the normal range. Warfarin therapy can be initiated per standard dosing guidelines, unless drug - drug interactions necessitate dose adjustments."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "VKORC1",
            "rec": "Patient has a lower than normal VKORC1 activity and may experience lower Vitamin K levels. Warfarin dose adjustments may be warranted."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "VKORC1",
            "rec": "Patient has lower than normal VKORC1 activity and may experience lower Vitamin K levels. Warfarin dose adjustments may be warranted."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "CYP2D6",
            "rec": "Patient has reduced or no metabolism of CYP2D6 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. atomoxetine, ondansetron, propafenone, tamoxifen, tricyclic antidepressants) OR lack of drug effectiveness from failure to produce the active form of the drug (e.g. codeine, hydrocodone, oxycodone, tramadol). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "CYP2D6",
            "rec": "Patient has reduced metabolism of CYP2D6 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. atomoxetine, ondansetron, propafenone, tamoxifen, tricyclic antidepressants) OR lack of drug effectiveness from failure to produce sufficient amount of the active form of the drug (e.g. codeine, hydrocodone, oxycodone, tramadol). Be aware of potential need for dose adjustments."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "CYP2D6",
            "rec": "Patient metabolizes CYP2D6 substrate drugs as expected (e.g. atomoxetine, ondansetron, opioids, propafenone, tamoxifen, tricyclic antidepressants). Drug therapies can be initiated per standard dosing guidelines."
        },
        {
            "class": "Ultrarapid Metabolizer",
            "gene": "CYP2D6",
            "rec": "Patient has a higher than average CYP2D6 substrate drug metabolism, leading to reduced drug effectiveness (e.g. atomoxetine, ondansetron, propafenone, tamoxifen, tricyclic antidepressants) OR increased risk of adverse drug reactions due to increased exposure to active drug metabolites (codeine, hydrocodone, oxycodone, tramadol). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "CYP2C19",
            "rec": "Patient has reduced or no metabolism of CYP2C19 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. tricyclic antidepressants) OR lack of drug effectiveness from failure to produce the active form of the drug (e.g. clopidogrel). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "CYP2C19",
            "rec": "Patient has reduced metabolism of CYP2C19 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. tricyclic antidepressants) OR lack of drug effectiveness from failure to produce sufficient amount of the active form of the drug (e.g. clopidogrel). Be aware of potential need for dose adjustments."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "CYP2C19",
            "rec": "Patient metabolizes CYP2C19 substrate drugs as expected (e.g. citalopram, clopidogrel, tricyclic antidepressants). Drug therapies can be initiated per standard dosing guidelines."
        },
        {
            "class": "Ultrarapid Metabolizer",
            "gene": "CYP2C19",
            "rec": "Patient has a higher than average CYP2C19 substrate drug metabolism, leading to reduced drug efficacy (e.g.  Citalopram, escitalopram, proton pump inhibitors, tricyclic antidepressants). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "TPMT",
            "rec": "Patient has normal ability to metabolize thiopurines (e.g. azathioprine, 6-mercaptopurine, thioguanine). Drug therapies can be initiated per standard dosing guidelines."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "TPMT",
            "rec": "Patient has reduced ability to metabolize thiopurines (e.g. azathioprine, 6-mercaptopurine, thioguanine) due to decreased TPMT activity and is at an increased an risk of myelosuppression. Dose reductions are indicated and/or avoid these medications whenever possible."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "TPMT",
            "rec": "Patient has reduced to no ability to metabolize thiopurines (e.g. azathioprine, 6-mercaptopurine, thioguanine) due to decreased to no TPMT activity and is at an increased an risk of myelosuppression. Significant dose reductions are indicated and/or avoid these medications whenever possible."
        },
        {
            "class": "Favorable Response",
            "gene": "IFNL3",
            "rec": "Patient may have increased eligibility for shortened treatment with peginterferon alfa 2a/2b, ribavirin, and protease inhibitor treatment."
        },
        {
            "class": "Unfavorable Response",
            "gene": "IFNL3",
            "rec": "Patient may have reduced eligibility for shortened treatment with peginterferon alfa 2a/2b, ribavirin, and protease inhibitor treatment."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "DPYD",
            "rec": "Patient has normal ability to metabolize DPYD subtrate drugs (e.g. capecitabine, fluorouracil, tegafur). Drug therapies can be initiated per standard dosing guidelines."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "DPYD",
            "rec": "Patient has reduced ability to metabolize DPYD substrate drugs (e.g. capecitabine, fluorouracil, tegafur) and may be at increased risk for fluoropyrimidine toxicity.  Dose reductions are indicated and/or avoid these medications whenever possible."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "DPYD",
            "rec": "Patient has reduced to no ability to metabolize DPYD substrate drugs (e.g. capecitabine, fluorouracil, tegafur) and are at increased risk for severe or even fatal fluoropyrimidine toxicity. Dose reductions are indicated and/or avoid these medications whenever possible."
        },
        {
            "class": "High Risk",
            "gene": "HLA-B*15:02",
            "rec": "Patient should avoid use of carbamazepine and phenytoin due to increased risk of developing severe carbamazepine-associated cutaneous adverse reactions. Consider the possibility of cross-reactivity with structurally similar antiepileptic drugs (e.g. oxcarbazepine, lamotrigine, phenytoin, phenobarbital, primidone)."
        },
        {
            "class": "Low Risk",
            "gene": "HLA-B*15:02",
            "rec": "Patient has a normal population risk for severe carbamazepine and phenytoin associated cutaneous adverse reactions."
        },
        {
            "class": "High Risk",
            "gene": "HLA-A*31:01",
            "rec": "Patient should avoid use of carbamazepine due to significantly increased risk  to develop carbamazepine-induced hypersensitivity reactions. "
        },
        {
            "class": "Low Risk",
            "gene": "HLA-A*31:01",
            "rec": "Patient has a normal population risk to develop carbamazepine-induced hypersensitivity reactions."
        },
        {
            "class": "High Risk",
            "gene": "SLCO1B1",
            "rec": "Patient has an increased risk for simvastatin-related muscle toxicity. Consider the possibility of alternative statins (e.g. atorvastatin, pitavastatin, pravastatin, rosuvastatin) or initiate simvastatin therapy at a lower dose."
        },
        {
            "class": "Intermediate Risk",
            "gene": "SLCO1B1",
            "rec": "Patient has an increased risk for simvastatin-related muscle toxicity. Consider the possibility of alternative statins (e.g. atorvastatin, pitavastatin, pravastatin, rosuvastatin) or initiate simvastatin therapy at a lower dose."
        },
        {
            "class": "Normal Risk",
            "gene": "SLCO1B1",
            "rec": "Patient has normal population risk for developing simvastatin-related muscle toxicity. Simvastatin can be initiated per standard dosing guideline."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "MTHFR",
            "rec": "Patient metabolizes MTHFR substrate drugs (e.g. methotrexate) as expected and has a normal population risk for adverse drug reactions."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "MTHFR",
            "rec": "Patient may have a reduced ability to metabolize MTHFR substrate drugs (e.g. methotrexate) and is at an increased risk of adverse drug reactions."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "SLC19A1",
            "rec": "Patient has a normal population risk for developing toxic liver disease and other adverse drug reactions when treated with leucovorin, mercaptopurine and methotrexate."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "SLC19A1",
            "rec": "Patient has an increased risk for developing toxic liver disease and other adverse drug reactions when treated with leucovorin, mercaptopurine and methotrexate."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "CYP3A5",
            "rec": "Patient metabolizes CYP3A5 substrate drugs (e.g. tacrolimus) faster than the average population, leading to reduced drug effectiveness. Be aware of significant dose adjustments in order to achieve therapeutic drug concentrations."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "CYP3A5",
            "rec": "Patient metabolizes CYP3A5 substrate drugs (e.g. tacrolimus) faster than the average population, leading to reduced drug effectiveness. Be aware of significant dose adjustments in order to achieve therapeutic drug concentrations."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "CYP3A5",
            "rec": "Patient metabolizes CYP3A5 substrate drugs (e.g. tacrolimus) as expected. Drug therapies can be initiated per standard dosing guidelines."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "CYP4F2",
            "rec": "Patient inactivates vitamin K as expected."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "CYP4F2",
            "rec": "Patient has reduced ability to inactivate vitamin K. This has implications for warfarin dosing."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "CYP4F2",
            "rec": "Patient has reduced ability to inactivate vitamin K. This has implications for warfarin dosing."
        },
        {
            "class": "Normal Metabolizer",
            "gene": "COMT",
            "rec": "Patient has normal ability to metabolize COMT substrate drugs (e.g. antispsychotics, cisplatin, opioids)."
        },
        {
            "class": "Intermediate Metabolizer",
            "gene": "COMT",
            "rec": "Patient has reduced ability to metabolize COMT subtrate drugs (e.g. antispsychotics, cisplatin, opioids), leading to an increased risk of adverse drug reactions. Be aware of potential need for dose adjustments."
        },
        {
            "class": "Poor Metabolizer",
            "gene": "COMT",
            "rec": "Patient has reduced to no ability to metabolize COMT subtrate drugs (e.g. antispsychotics, cisplatin, opioids), leading to an increased risk of adverse drug reactions. Be aware of potential need for dose adjustments."
        },
        {
            "class": "Favorable Response",
            "gene": "ABCG2",
            "rec": "Patient has expected exposure and pharmacodynamics of ABCG2 substrate drugs (e.g. methotrexate, statins)."
        },
        {
            "class": "Unfavorable Response",
            "gene": "ABCG2",
            "rec": "Patient may have increased systemic exposure and altered pharmacodynamics of ABCG2 substrate drugs (e.g. methotrexate, statins)."
        },
        {
            "class": "Favorable Response",
            "gene": "ABCB1",
            "rec": "Patient has expected exposure and pharmacodynamics of ABCB1 substrate drugs (e.g. digoxin, morphine, tacrolimus)."
        },
        {
            "class": "Unfavorable Response",
            "gene": "ABCB1",
            "rec": "Patient may have increased systemic exposure and altered pharmacodynamics of ABCB1 substrate drugs (e.g. digoxin, morphine, tacrolimus)."
        },
        {
            "class": "Favorable Response",
            "gene": "GRIK4",
            "rec": "Patient may respond favorably to citalopram therapy when used for treatment of depression."
        },
        {
            "class": "Unfavorable Response",
            "gene": "GRIK4",
            "rec": "Patient may respond less favorably to citalopram therapy when used for treatment of depression."
        }
    ],
    "Genes": {
        "ABCB1": "transporter",
        "ABCG2": "transporter",
        "ANKK1": "predictor",
        "COMT": "metabolizer",
        "CYP2C19": "metabolizer",
        "CYP2C9": "metabolizer",
        "CYP2D6": "metabolizer",
        "CYP3A5": "metabolizer",
        "CYP4F2": "metabolizer",
        "DPYD": "metabolizer",
        "GRIK4": "predictor",
        "HLA-A*31:01": "immune",
        "HLA-B*15:02": "immune",
        "HLA-B*57:01": "immune",
        "HLA-B*58:01": "immune",
        "IFNL3": "predictor",
        "MTHFR": "catalyzer",
        "SLCO1B1": "transporter",
        "SLC19A1": "transporter",
        "TPMT": "metabolizer",
        "VKORC1": "metabolizer"
    },
    "Recommendations": [
        {
            "classes": [
                "High Risk"
            ],
            "drug": "Abacavir",
            "genes": [
                "HLA-B*57:01"
            ],
            "pubmed": [
                "22378157",
                "18826546",
                "19640227",
                "21174626",
                "21412232"
            ],
            "rec": "The patient is an HLA-B*57:01 allele carrier and  therefore is at a higher risk to develop abacavir induced hypersensitivity reaction. Treatment with an abacavir-containing regimen is not recommended and should be considered only under exceptional circumstances when the potential benefit outweighs the risk. The risk for HLA-B*57:01 carriers to develop significant hypersensitivity reactions  is above 50%. "
        },
        {
            "classes": [
                "Low Risk"
            ],
            "drug": "Abacavir",
            "genes": [
                "HLA-B*57:01"
            ],
            "pubmed": [
                "22378157",
                "18826546",
                "19640227",
                "21174626",
                "21412232"
            ],
            "rec": "The patient does not carry the  HLA-B*57:01 allele and has normal population risk to develop abacavir induced hypersensitivity reaction. However, this occurs significantly less frequently than in HLA-B*5701-positive patients. Treatment with abacavir-containing regimen can be initiated per standard dosing guidelines."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Acenocoumarol",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9.  Initiate acenocoumarol therapy per standard dosing guidelines.  Check INR more frequently after initiating or discontinuing NSAIDs.   Adjust acenocoumarol dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Acenocoumarol",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9.  Initiate acenocoumarol therapy per standard dosing guidelines.  Check INR more frequently during dose titration and after initiating or discontinuing NSAIDs.   Adjust acenocoumarol dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Acenocoumarol",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9.  Initiate acenocoumarol therapy per standard dosing guidelines. Adjust acenocoumarol dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9. Initiate therapy per standard loading dose guidelines. Reduce initial maintenance doses by 25% of standard phenytoin dosing. Subsequent doses should be adjusted according to therapeutic drug monitoring and response. Monitor closely for adverse drug reactions (e.g. ataxia, nystagmus, dysarthria, sedation) due to reduced drug clearance."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Low Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9",
                "HLA-B*15:02"
            ],
            "pubmed": [
                "25099164"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 and does NOT carry the HLA-B*15:02 allele. Initiate therapy per standard loading dose guidelines. Reduce initial maintenance doses by 25% of standard phenytoin dosing. Subsequent doses should be adjusted according to therapeutic drug monitoring and response. Monitor closely for adverse drug reactions (e.g. ataxia, nystagmus, dysarthria, sedation) due to reduced drug clearance."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "High Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9",
                "HLA-B*15:02"
            ],
            "pubmed": [
                "25099164"
            ],
            "rec": "The patient is an  HLA-B*15:02 allele carrier and is an intermediate metabolizer for CYP2C9. Regardless of the CYP2C9 genotype and individual's ancestry or age, the patient is at increased risk to develop phenytoin associated severe cutaneous reactions such as Stevens-Johnson syndrome (SJS) and toxic epidermal necrolysis (TEN). Consideration should be given to avoiding phenytoin or carbamazepine in patients positive for HLA-B*1502. It is recommended to consider using an anticonvulsant other than phenytoin and carbamazepine unless the benefits of treating the underlying disease clearly outweigh the risks. Alternative medications such as oxcarbazepine, eslicarbazepine acetate, and lamotrigine have some evidence linking SJS/TEN with the HLA-B*15:02 allele and thus caution should be used in choosing alternatives to phenytoin."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9.  Initiate therapy per standard loading dose guidelines. Reduce initial maintenance doses by 50 % of standard phenytoin dosing. Subsequent doses should be adjusted according to therapeutic drug monitoring and response. Monitor closely for adverse drug reactions (e.g. ataxia, nystagmus, dysarthria, sedation) due to reduced drug clearance. "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Low Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9",
                "HLA-B*15:02"
            ],
            "pubmed": [
                "25099164"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 and does NOT carry the HLA-B*15:02 allele. Initiate therapy per standard loading dose guidelines. Reduce initial maintenance doses by 50 % of standard phenytoin dosing. Subsequent doses should be adjusted according to therapeutic drug monitoring and response. Monitor closely for adverse drug reactions (e.g. ataxia, nystagmus, dysarthria, sedation) due to reduced drug clearance. "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "High Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9",
                "HLA-B*15:02"
            ],
            "pubmed": [
                "25099164"
            ],
            "rec": "The patient is an  HLA-B*15:02 allele carrier and is a poor metabolizer for CYP2C9. Regardless of the CYP2C9 genotype and individual's ancestry or age, the patient is at increased risk to develop phenytoin associated severe cutaneous reactions such as Stevens-Johnson syndrome (SJS) and toxic epidermal necrolysis (TEN). Consideration should be given to avoiding phenytoin or carbamazepine in patients positive for HLA-B*1502. It is recommended to consider using an anticonvulsant other than phenytoin and carbamazepine unless the benefits of treating the underlying disease clearly outweigh the risks. Alternative medications such as oxcarbazepine, eslicarbazepine acetate, and lamotrigine have some evidence linking SJS/TEN with the HLA-B*15:02 allele and thus caution should be used in choosing alternatives to phenytoin."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9. Initiate phenytoin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to therapeutic drug monitoring and response. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Low Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9",
                "HLA-B*15:02"
            ],
            "pubmed": [
                "25099164"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9 and does NOT carry the HLA-B*15:02 allele.  Initiate phenytoin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to therapeutic drug monitoring and response. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "High Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "CYP2C9",
                "HLA-B*15:02"
            ],
            "pubmed": [
                "25099164"
            ],
            "rec": "The patient is an  HLA-B*15:02 allele carrier and is a normal metabolizer for CYP2C9. Regardless of the CYP2C9 genotype and individual's ancestry or age, the patient is at increased risk to develop phenytoin associated severe cutaneous reactions such as Stevens-Johnson syndrome (SJS) and toxic epidermal necrolysis (TEN). Consideration should be given to avoiding phenytoin or carbamazepine in patients positive for HLA-B*1502. It is recommended to consider using an anticonvulsant other than phenytoin and carbamazepine unless the benefits of treating the underlying disease clearly outweigh the risks. Alternative medications such as oxcarbazepine, eslicarbazepine acetate, and lamotrigine have some evidence linking SJS/TEN with the HLA-B*15:02 allele and thus caution should be used in choosing alternatives to phenytoin."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9.  Initiate warfarin therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments. Subsequent doses should be adjusted according to the INR , response to therapy and disease state. http://www.warfarindosing.org/"
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9 and a normal metabolizer for VKORC1.  Initiate warfarin therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments. Subsequent doses should be adjusted according to the INR , response to therapy and disease state. http://www.warfarindosing.org/"
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9 and and intermediate metabolizer for VKORC1.  Initiate warfarin therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments. Subsequent doses should be adjusted according to the INR , response to therapy and disease state. http://www.warfarindosing.org/"
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C9 and and a poor metabolizer for VKORC1. Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR , response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 (*1/*2).  Initiate warfarin therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments. Subsequent doses should be adjusted according to the INR , response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 (*1/*3).  Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR , response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 (*1/*2) and a normal metabolizer for VKORC1.  Initiate warfarin therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 (*1/*3) and a normal metabolizer for VKORC1. Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 and an intermediate metabolizer for VKORC1.  Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 (*1/*2) and a poor metabolizer for VKORC1.  Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C9 (*1/*3) and a poor metabolizer for VKORC1.  Reduce initial warfarin starting dose by 75% to 90%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 (*2/*3). Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 (*3/*3). Reduce initial warfarin starting dose by 75% to 90%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 (*2/*3) and a normal metabolizer for VKORC1. Reduce initial warfarin starting dose by 25% to 50%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 (*3/*3) and a normal metabolizer for VKORC1. Reduce initial warfarin starting dose by 75% to 90%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 and an intermediate metabolizer for VKORC1. Reduce initial warfarin starting dose by 75% to 90%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP2C9",
                "VKORC1"
            ],
            "pubmed": [
                "21900891"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C9 and a poor metabolizer for VKORC1. Reduce initial warfarin starting dose by 75% to 90%  per standard dosing guidelines, unless drug- drug interactions necessitate further dose adjustments. Subsequent doses should be adjusted according to the INR, response to therapy and disease state. http://www.warfarindosing.org"
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Celecoxib",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2C9. Administer celecoxib with caution and reduce initial celecoxib starting dose to half the lowest recommended dose, with a maximum recommended dose of 100 mg daily. Monitor closely for adverse drug reactions due to reduced drug clearance.  "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Celecoxib",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2C9. Initiate celecoxib therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Celecoxib",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2C9. Initiate celecoxib therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Flurbiprofen",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2C9. Flurbiprofen should be administered with caution as this patient may have abnormally high plasma levels due to reduced metabolic clearance. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Flurbiprofen",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2C9. Initiate flurbiprofen therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Flurbiprofen",
            "genes": [
                "CYP2C9"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2C9. Initiate flurbiprofen therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Acenocoumarol",
            "genes": [
                "VKORC1"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "Patient is an intermediate metabolizer for VKORC1. Initiate acenocoumarol therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments.  Check INR more frequently and adjust acenocoumarol dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Acenocoumarol",
            "genes": [
                "VKORC1"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "Patient is a poor metabolizer for VKORC1.  Initiate acenocoumarol therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments.  Check INR more frequently and adjust acenocoumarol dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Acenocoumarol",
            "genes": [
                "VKORC1"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "Patient is a normal metabolizer for VKORC1. Initiate acenocoumarol therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments.  Adjust acenocoumarol dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "VKORC1"
            ],
            "pubmed": [],
            "rec": "Patient is a normal metabolizer for VKORC1. Initiate warfarin therapy per standard dosing guidelines, unless drug- drug interactions necessitate dose adjustments.  Adjust warfarin dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "High Risk"
            ],
            "drug": "Allopurinol",
            "genes": [
                "HLA-B*58:01"
            ],
            "pubmed": [
                "23232549"
            ],
            "rec": "The patient is an HLA-B*58:01 allele carrier and therefore is at a higher risk to develop allopurinol induced severe cutaneous adverse reactions (SCAR).  The positive predictive value for HLA-B*58:01 is ~1.5% and the negative predictive value is 100%. Treatment with allopurinol is not recommended and should be considered only under exceptional circumstances when the potential benefit outweighs the risk."
        },
        {
            "classes": [
                "Low Risk"
            ],
            "drug": "Allopurinol",
            "genes": [
                "HLA-B*58:01"
            ],
            "pubmed": [
                "23232549"
            ],
            "rec": "The patient does not carry the HLA-B*58:01 allele and has normal population risk to develop allopurinol associated severe cutaneous adverse reactions (SCAR). However, this occurs significantly less frequently than in HLA-B*58:01-positive patients. Treatment with allopurinol can be initiated per standard dosing guidelines."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6.  Use of amitriptyline and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If amitriptyline treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for both CYP2D6 and CYP2C19. Use of amitriptyline and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If amitriptyline treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a normal metabolizer for CYP2C19.  Use of amitriptyline and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If amitriptyline treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Use of amitriptyline and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If amitriptyline treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of amitriptyline and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If amitriptyline treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate amitriptyline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If amitriptyline is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for both CYP2D6 and CYP2C19. Initiate amitriptyline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Initiate amitriptyline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Consider reducing initial amitriptyline dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial amitriptyline dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If amitriptyline is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and a normal metabolizer of CYPC19. Consider reducing initial amitriptyline dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for both CYP2D6 and CYPC19. Consider reducing initial amitriptyline dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of amitriptyline and other tricyclic antidepressants should be avoided. If amitriptyline is warranted, monitor closely for symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial amitriptyline dose by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an ultrarapid metabolizer for CYP2C19.  Use of amitriptyline and other tricyclic antidepressants should be avoided. Due to the CYP2D6 poor and CYP2C19 ultrarapid metabolizer status of this patient, drug clearance and drug efficacy are uncertain. If amitriptyline is warranted, monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and a normal metabolizer for CYP2C19. Consider reducing initial amitriptyline dose by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Consider reducing initial amitriptyline dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.    "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for both CYP2D6 and  CYP2C19. Use of amitriptyline and other tricyclic antidepressants should be avoided due to decreased drug clearance and an increased risk of adverse drug events. Consider an alternative drug class for treatment. If amitriptyline treatment is warranted, adjust subsequent doses according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Aripiprazole",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial aripiprazole dosing by 67% of the standard dosing guideline. It is recommended to not exceed a maximum dose of 10mg/day  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Aripiprazole",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate aripiprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Aripiprazole",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate aripiprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Aripiprazole",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 which may increase drug clearance. Initiate aripiprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Atomoxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Initiate atomoxetine therapy per standard dosing guidelines. Be alert to adverse drug reactions due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Atomoxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6.  Initiate atomoxetine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Atomoxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate atomoxetine therapy per standard dosing guidelines.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Atomoxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6.  Be alert to potential lack of efficacy  and increased drug clearance of atomoxetine. Consider an alternative therapeutic class (e.g. clonidine, methylphenidate).  If atomoxetine is warranted, adjust subsequent doses according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial clomipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.    "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an ultrarapid metabolizer for CYP2C19.  Use of clomipramine and other tricyclic antidepressants should be avoided. Due to the CYP2D6 poor and CYP2C19 ultrarapid metabolizer status of this patient, drug clearance and drug efficacy are uncertain. If clomipramine is warranted, monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and a normal metabolizer for CYP2C19. Consider reducing initial clomipramine dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Consider reducing initial clomipramine dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for both CYP2D6 and  CYP2C19. Use of clomipramine and other tricyclic antidepressants should be avoided due to decreased drug clearance and an increased risk of adverse drug events. Consider an alternative treatment. If clomipramine treatment is warranted, adjust subsequent doses according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial clomipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If clomipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and a normal metabolizer of CYPC19. Consider reducing initial clomipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for both CYP2D6 and CYPC19. Consider reducing initial clomipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and a poor metabolizer for CYP2C19.  Use of clomipramine and other tricyclic antidepressants should be avoided. If clomipramine is warranted, monitor closely for symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate clomipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If clomipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for both CYP2D6 and CYP2C19. Initiate clomipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Initiate clomipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Consider reducing initial clomipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6.  Use of clomipramine and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug (citalopram, sertaline) not metabolized by CYP2D6.  If clomipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for both CYP2D6 and CYP2C19. Use of clomipramine and other tricyclic antidepressants should be avoided. If clomipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Adjust clomipramine dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a normal metabolizer for CYP2C19.  Use of clomipramine and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If clomipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Use of clomipramine and other tricyclic antidepressants should be avoided. If clomipramine treatment is warranted, monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of clomipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If clomipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Codeine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447",
                "24458010",
                "22205192"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and is at higher risk for toxicity from increased morphine formation from codeine metabolism. Avoidance of morphine pro-drugs (e.g. codeine, tramadol and to a lesser extent  hydrocodone, oxycodone) is recommended. Morphine and non-opioid analgesics are suitable alternatives as their metabolism is not affected by CYP2D6."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Codeine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447",
                "24458010",
                "22205192"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and will respond to codeine therapy as expected. Initiate codeine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Codeine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447",
                "24458010",
                "22205192"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and may respond to codeine therapy with reduced morphine formation. Initiate codeine therapy per standard dosing guidelines. If pain relief is not adequate, consider alternative drug therapies such as morphine or a non-opioid analgesics. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Codeine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447",
                "24458010",
                "22205192"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and may not respond to codeine therapy. Due to significantly reduced morphine formation patient may experience insufficient pain relief.  Avoidance of morphine pro-drugs (e.g. codeine, tramadol and to a lesser extent  hydrocodone, oxycodone) is recommended.  Morphine and non-opioid analgesics are suitable alternatives as their metabolism is not affected by CYP2D6."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Desipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial desipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Desipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial desipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Desipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate desipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Desipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Avoid the use of desipramine and other tricyclic antidepressants due to increased drug clearance and reduced drug efficacy. If possible use an alternative therapeutic drug class based on the symptoms of the patient. If desipramine is warranted, monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6.  Use of doxepin and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug (citalopram, sertraline) not metabolized by CYP2D6.  If doxepin treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for both CYP2D6 and CYP2C19. Use of doxepin and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If doxepin treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a normal metabolizer for CYP2C19.  Use of doxepin and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug (citalopram, sertraline) not metabolized by CYP2D6. If doxepin treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Use of doxepin and other tricyclic antidepressants  should be avoided. If doxepin is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Adjust doxepin dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of doxepin and other tricyclic antidepressants should be avoided as drug clearance and drug efficacy in this patient are uncertain. If doxepin is warranted, monitor closely for symptom resolution and adjust doxepin dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate doxepin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If doxepin is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for both CYP2D6 and CYP2C19. Initiate doxepin therapy per standard dosing guidelines.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Initiate doxepin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Consider reducing initial doxepin dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial doxepin dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If doxepin is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and a normal metabolizer of CYPC19. Consider reducing initial doxepin dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for both CYP2D6 and CYPC19. Consider reducing initial doxepin dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and a poor metabolizer for CYP2C19.  Use of doxepin and other tricyclic antidepressants as should be avoided.  If doxepin is warranted, monitor closely for symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial doxepin dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an ultrarapid metabolizer for CYP2C19.  Use of doxepin and other tricyclic antidepressants should be avoided. Due to the CYP2D6 poor and CYP2C19 ultrarapid metabolizer status of this patient, drug clearance and drug efficacy are uncertain. If doxepin is warranted, monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and a normal metabolizer for CYP2C19. Consider reducing initial doxepin dose by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Consider reducing initial doxepin dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.    "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for both CYP2D6 and  CYP2C19. Use of doxepin and other tricyclic antidepressants should be avoided due to decreased drug clearance and an increased risk of adverse drug events. Consider an alternative treatment. If doxepin treatment is warranted, adjust subsequent doses according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Flecainide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial flecainide dose by 50 % of the standard dosing guideline.  Monitor ECG for changes and be aware of adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Flecainide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Consider reducing initial flecainide dose by 25 % of the standard dosing guideline. Monitor ECG for changes and be aware of adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Flecainide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate flecainide therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Flecainide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and may experience increased drug clearance and reduced drug efficacy.  An alternative to flecainide (e.g. amiodarone, disopyramide, quinidine, sotalol) is recommended.  If flecainide therapy is warranted, closely monitor ECG and adjust flecainide dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Haloperidol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6.  An alternative to haloperidol (e.g. clozapine, flupenthixol, fluphenazine, olanzapine, pimozide, quetiapine) is recommended or consider reducing initial haloperidol dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Haloperidol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate haloperidol therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Haloperidol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate haloperidol therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Haloperidol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and may experience increased drug clearance and reduced drug efficacy.  An alternative to haloperidol (e.g. clozapine, flupenthixol, fluphenazine, olanzapine, pimozide, quetiapine) is recommended.  If haloperidol therapy is warranted, be aware of reduced drug efficacy and adjust subsequent haloperidol dose based upon patient response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial imipramine dose by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an ultrarapid metabolizer for CYP2C19.  Use of imipramine and other tricyclic antidepressants should be avoided. Due to the CYP2D6 poor and CYP2C19 ultrarapid metabolizer status of this patient, drug clearance and drug efficacy are uncertain. If imipramine is warranted, monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and a normal metabolizer for CYP2C19. Consider reducing initial imipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Consider reducing initial imipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for both CYP2D6 and  CYP2C19. Use of imipramine and other tricyclic antidepressants should be avoided due to decreased drug clearance and an increased risk of adverse drug events. Consider an alternative drug class for treatment. If imipramine treatment is warranted, adjust subsequent doses according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial imipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If imipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and a normal metabolizer of CYPC19. Consider reducing initial imipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for both CYP2D6 and CYPC19. Consider reducing initial imipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of imipramine and other tricyclic antidepressants should be avoided. If imipramine is warranted, monitor closely for symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate imipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If imipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for both CYP2D6 and CYP2C19. Initiate imipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Initiate imipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Consider reducing initial imipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.    "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6.  Use of imipramine and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If imipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for both CYP2D6 and CYP2C19. Use of imipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If amitriptyline treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a normal metabolizer for CYP2C19.  Use of imipramine and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If imipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Use of imipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If imipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of imipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If imipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Metoprolol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. An alternative therapy (for heart failure: bisoprolol, carvedilol; for all other indications: atenolol, bisoprolol) is recommended.  If metoprolol is warranted, consider a 75% dose reduction of standard metoprolol dosing.   Monitor closely for adverse drug reactions due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Metoprolol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. An alternative therapy (for heart failure: bisoprolol, carvedilol; for all other indications: atenolol, bisoprolol) is recommended.  If metoprolol is warranted, consider a 50% dose reduction of standard metoprolol dosing. Monitor closely for adverse drug reactions due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Metoprolol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate metoprolol therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Metoprolol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and may experience increased drug clearance and reduced drug efficacy. An alternative therapy (for heart failure: bisoprolol, carvedilol; for all other indications: atenolol, bisoprolol) is recommended.  If metoprolol is warranted, titrate dose to a maximum of 250% of standard metoprolol dosing in response to efficacy. Monitor closely for adverse drug reactions and adjust metoprolol dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Nortriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Avoid the use of nortriptyline and other tricyclic antidepressants due to increased drug clearance and reduced drug efficacy. If possible use an alternative therapeutic drug class based on the symptoms of the patient. If nortriptyline is warranted, monitor closely for symptom resolution and adjust nortriptyline dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Nortriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate nortriptyline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Nortriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial nortripyline dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Nortriptyline",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial nortripyline dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Oxycodone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and may not respond to oxycodone therapy. Due to significantly reduced morphine formation patient may experience insufficient pain relief.  Avoidance of morphine pro-drugs (e.g. codeine, tramadol and to a lesser extent  hydrocodone, oxycodone) is recommended. Morphine and non-opioid analgesics are suitable alternatives as their metabolism is not affected by CYP2D6."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Oxycodone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and may respond to oxycodone therapy with reduced morphine formation. Initiate oxycodone therapy per standard dosing guidelines. If pain relief is not adequate, consider alternative drug therapies such as morphine or a non-opioid analgesics. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Oxycodone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and will respond to oxycodone therapy as expected. Initiate oxycodone therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Oxycodone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and is at higher risk for toxicity from increased morphine formation from oxycodone metabolism. Avoidance of morphine pro-drugs (e.g. codeine, tramadol and to a lesser extent  hydrocodone, oxycodone) is recommended. Morphine and non-opioid analgesics are suitable alternatives as their metabolism is not affected by CYP2D6."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Paroxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Select alternative drug not predominantly metabolized by CYP2D6 (e.g. citalopram, sertraline). If paroxetine use is warranted, consider reducing initial dose by 50% of recommended starting dose. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Paroxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate paroxetine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Paroxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate paroxetine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Paroxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Avoid the use of paroxetine due to increased drug clearance and reduced drug efficacy. Select an alternative drug not predominantly metabolized by CYP2D6 (e.g. citalopram, sertraline)."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Propafenone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial propafenone dose by 70% of standard dosing guideline. Record ECG and monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Propafenone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Consider an alternative therapeutic class (e.g. amiodarone, disopyramide, quinidine, sotalol).  If propafenone is warranted, record ECG and monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Propafenone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate propafenone therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Propafenone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 which may increase drug clearance and reduce drug efficacy of propafenone. Consider an alternative therapeutic class (e.g. amiodarone, disopyramide, quinidine, sotalol).  If propafenone is warranted, record ECG and adjust propafenone dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Risperidone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider an alternative therapeutic class (e.g. clozapine, olanzapine, quetiapine) due to reduced drug clearance. If risperidone is warranted, be alert to adverse drug reactions and adjust risperidone dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Risperidone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Consider an alternative therapeutic class (e.g. clozapine, olanzapine, quetiapine) due to reduced drug clearance. If risperidone is warranred, be alert to adverse drug reactions and adjust risperidone dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Risperidone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate risperidone therapy per standard dosing guidelines. Adjust risperidone dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Risperidone",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 which may increase drug clearance and reduce drug efficacy of risperidone. Consider an alternative therapeutic class (e.g. clozapine, olanzapine, quetiapine).  If risperidone is warranted, be alert to adverse drug reactions and adjust risperidone dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Tamoxifen",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6.  An increased risk for breast cancer relapse is present, and it is advised that an aromatase inhibitor be considered for treating postmenopausal women with breast cancer. If tamoxifen is warranted, initiate tamoxifen therapy per standard dosing guidelines and be alert to adverse drug reaction. Adjust tamoxifen based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Tamoxifen",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. An increased risk for breast cancer relapse is present, and it is advised that an aromatase inhibitor be considered for treating postmenopausal women with breast cancer. If tamoxifen is warranted, initiate tamoxifen therapy per standard dosing guidelines, avoid concomitant use of CYP2D6 inhibitors and be alert to adverse drug reaction. Adjust tamoxifen based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Tamoxifen",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate tamoxifen therapy per standard dosing guidelines.  Adjust tamoxifen dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Tamoxifen",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Initiate tamoxifen therapy per standard dosing guidelines. Adjust tamoxifen dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Tramadol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and may not respond to tramadol therapy. Due to significantly reduced  formation of active metabolites of tramadol, the patient may experience insufficient pain relief.  Avoidance of morphine pro-drugs (e.g. codeine, hydrocodone, oxycodone) is recommended.  Morphine and non-opioid analgesics (e.g. acetaminophen, NSAID) are suitable alternatives to tramadol as their metabolism is not affected by CYP2D6."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Tramadol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Due to reduced  formation of the active metabolites of tramadol, the patient may experience insufficient pain relief; be alert to decreased efficacy. Initiate tramadol therapy per standard dosing guidelines. If response is inadequate,  morphine and non-opioid analgesics (e.g. acetaminophen, NSAID) are suitable alternatives to tramadol as their metabolism is not affected by CYP2D6."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Tramadol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and will respond to tramadol therapy as expected. Initiate tramadol therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Tramadol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and is at higher risk for toxicity from increased active metabolites formation from tramadol metabolism. Avoidance of morphine pro-drugs (e.g. codeine, hydrocodone, oxycodone) is recommended. Morphine and non-opioid analgesics (e.g. acetaminophen, NSAID) are suitable alternatives as their metabolism is not affected by CYP2D6.  If tramadol is warranted, consider reducing the dose by 30% of standard tramadol dosing. Monitor closely for adverse drug reactions  and adjust tramadol dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Use of trimipramine and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If trimipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state"
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for both CYP2D6 and CYP2C19. Use of trimipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If trimipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a normal metabolizer for CYP2C19.  Use of trimipramine and other tricyclic antidepressant CYP2D6 substrates should be avoided due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6.  If trimipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Use of trimipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If trimipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Ultrarapid Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of trimipramine and other tricyclic antidepressants should be avoided due to potential lack of efficacy and increased drug clearance. If trimipramine treatment is warranted, consider increasing the starting dose and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate trimipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If trimipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for both CYP2D6 and CYP2C19. Initiate trimipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Initiate trimipramine therapy per standard dosing guidelines.  Adjust trimipramine dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Normal Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Consider reducing initial trimipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. Consider reducing initial trimipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If trimipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Adjust trimipramine dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6 and a normal metabolizer of CYPC19. Consider reducing initial trimipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for both CYP2D6 and CYPC19. Consider reducing initial trimipramine dose by 25 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Intermediate Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6 and a poor metabolizer for CYP2C19. Use of trimipramine and other tricyclic antidepressants should be avoided. If trimipramine is warranted, monitor closely for symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6. Consider reducing initial trimipramine dose by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "Avoid the use of trimipramine and other tricyclic antidepressants as patient is a poor metabolizer for CYP2D6 and an ultrarapid metabolizer for CYP2C19. Due to the CYP2D6 poor and CYP2C19 ultrarapid metabolizer status of this patient, drug clearance and drug efficacy are uncertain. If trimipramine is warranted, monitor closely for symptom resolution and adjust trimipramine dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and a normal metabolizer for CYP2C19. Consider reducing initial trimipramine dose by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Intermediate Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2D6 and an intermediate metabolizer for CYP2C19. Consider reducing initial trimipramine dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.    "
        },
        {
            "classes": [
                "Poor Metabolizer",
                "Poor Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19",
                "CYP2D6"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for both CYP2D6 and  CYP2C19. Use of trimipramine and other tricyclic antidepressants should be avoided due to decreased drug clearance and an increased risk of adverse drug events. Consider an alternative drug class for treatment. If trimipramine treatment is warranted, adjust subsequent doses according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Venlafaxine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an poor metabolizer for CYP2D6. Consider an alternative therapeutic drug (e.g. citalopram, sertraline) due to reduced drug clearance. If venlafaxine is warranted, be alert to adverse drug reactions and adjust venlafaxine dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Venlafaxine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. which may reduce drug clearance. Consider an alternative therapeutic drug (e.g. citalopram, sertraline) due to reduced drug clearance. If venlafaxine is warranted, be alert to adverse drug reactions and adjust venlafaxine dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Venlafaxine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate venlafaxine therapy per standard dosing guidelines. Adjust venlafaxine dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Venlafaxine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 which may increase drug clearance and reduce drug efficacy of venlafaxine. Consider an alternative therapeutic drug  (e.g. citalopram, sertraline).  If venlafaxine is warranted, titrate dose to a maximum of 150% of standard venlafaxine dosing. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Zuclopenthixol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer of CYP2D6. An alternative therapy (e.g. flupenthixol, quetiapine, olanzapine, clozapine) is recommended. If zuclopenthixol is warranted, consider a 50% dose reduction of standard zuclopenthixol dosing. Monitor closely for adverse drug reactions due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Zuclopenthixol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer of CYP2D6. An alternative therapy (e.g. flupenthixol, quetiapine, olanzapine, clozapine) should be considered due to reduced drug clearance. If zuclopenthixol is warranted, consider a 25% reduction of standard zuclopenthixol dosing. Based on genotype and age of this patient, initiate therapy with  ___. Monitor closely for adverse drug reactions and adjust zuclopenthixol dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Zuclopenthixol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate zuclopenthixol therapy per standard dosing guidelines.  Adjust zuclopenthixol dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Zuclopenthixol",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 which may increase drug clearance and reduce drug efficacy of zuclopenthixol. Consider an alternative therapeutic class (e.g. clozapine, flupenthixol, olanzapine, quetiapine). If zuclopenthixol is warranted, be alert to adverse drug reactions and adjust zuclopenthixol dose based upon patient response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Fluvoxamine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. Fluvoxamine should be used cautiously in patients known to have reduced levels of CYP2D6 activity. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Consider a 25-50% reduction of recommended starting dose and titrate to response or use an alternative drug not metabolized by CYP2D6 (e.g., sertraline)."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Fluvoxamine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate fluvoxamine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Fluvoxamine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate fluvoxamine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Fluvoxamine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Data are lacking describing the effect of CYP2D6 ultrarapid metabolism on fluvoxamine therapy. Select an alternative SSRI not extensively metabolized by CYP2D6  (e.g., sertraline) due to the lack of data describing how CYP2D6 ultrarapid metabolizer status influences fluvoxamine therapy. If fluvoxamine therapy is warranted, initiate fluvoxamine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Pimozide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. Pimozide doses should not exceed 0.05mg/kg/day in children or 4 mg/day in adults. Adjustments to doses should not be made earlier than 14 days post therapy initiation.  Adjust pimozide dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Pimozide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate pimozide therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Pimozide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate pimozide therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Pimozide",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Initiate pimozide therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.     "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Dextromethorphan and quinidine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. The quinidine component of NUEDEXTA is a CYP2D6 inhibitor used to increase the plasma availability of dextromethorphan, which is metabolized by CYP2D6. Therefore, CYP2D6 poor metabolizers may be at risk of experiencing toxicity from increase quinidine levels. Initiate dextromethorphan and quinidine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Dextromethorphan and quinidine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate dextromethorphan and quinidine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Dextromethorphan and quinidine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate dextromethorphan and quinidine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Dextromethorphan and quinidine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 which may result in increased drug clearance and subtherapeutic drug concentrations. Initiate dextromethorphan and quinidine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Tetrabenazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. Initiate tetrabenazine therapy per standard dosing guidelines, but subsequent tetrabenazine dose should not exceed 50 mg per day and the maximum recommended single dose is 25 mg. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Tetrabenazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6.  Initiate tetrabenazine therapy per standard dosing guidelines, but subsequent tetrabenazine dose should not exceed 100 mg per day and the maximum recommended single dose is 37.5 mg. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Tetrabenazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate tetrabenazine therapy per standard dosing guidelines, but subsequent tetrabenazine dose should not exceed 100 mg per day and the maximum recommended single dose is 37.5 mg. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Tetrabenazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Initiate tetrabenazine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Thioridazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. Thioridazine is contraindicated in patients with reduced CYP2D6 activity, due to reduced drug clearance  and increased risk of potential of fatal side effects."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Thioridazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate thioridazine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Thioridazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate thioridazine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Thioridazine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Initiate thioridazine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Vortioxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. The plasma concentration of vortioxetine is approximately two times higher in CYP2D6 poor metabolizers as compared to normal metabolizers. Therefore vortioxetine dose should not exceed 10 mg/day. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Vortioxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate vortioxetine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Vortioxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate vortioxetine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Vortioxetine",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6. Initiate vortioxetine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Ondansetron",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2D6. Initiate ondansetron per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Ondansetron",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2D6. Initiate ondansetron per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Ondansetron",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2D6. Initiate ondansetron per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Ondansetron",
            "genes": [
                "CYP2D6"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2D6 and is more likely to have a decreased response to ondansetron due to potential lack of efficacy and increased drug clearance. Consider an alternative drug  not metabolized by CYP2D6. If ondansetron is warranted, initiate ondansetron per standard dosing guidelines and monitor closely for symptom resolution. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial amitriptyline dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a intermediate metabolizer for CYP2C19. Initiate amitriptyline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate amitriptyline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Amitriptyline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If amitriptyline is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Citalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial citalopram dosing by 50 % of the standard dosing guideline and titrate to response or select alternative drug not predominantly metabolized by CYP2C19 (e.g. fluoxetine, paroxetine). Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Citalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate citalopram therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Citalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate citalopram therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Citalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Consider an alternative SSRI not metabolized by CYP2C19 (e.g. fluoxetine, paroxetine). If citalopram is warranted, monitor closely for symptom resolution and adjust citalopram dose up to a maximum of 150%of the standard dosing guideline due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial clomipramine dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate clomipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate clomipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clomipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If clomipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clopidogrel",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19 and will respond to clopidogrel therapy with increased platelet inhibition. Initiate clopidogrel therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Clopidogrel",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate clopidogrel therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. ."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Clopidogrel",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19 and may respond to clopidogrel therapy with reduced platelet inhibition and increased risk for adverse cardiovascular events.  Consider an alternative antiplatelet therapy (e.g. prasugrel, ticagrelor) if there are no contraindications.  If clopidogrel therapy is warranted, adjust clopidogrel dose based upon patient response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Clopidogrel",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19 and may experience failure of clopidogrel therapy. Poor metabolizers on clopidogrel may have significantly reduced platelet inhibition and increased risk for adverse cardiovascular events. An alternative antiplatelet therapy  (e.g. prasugrel, ticagrelor) is strongly recommended."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial doxepin dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate doxepin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate doxepin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Doxepin",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If doxepin is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state. ."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Escitalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial escitalopram dosing by 50 % of the standard dosing guideline and titrate to response or select alternative drug not predominantly metabolized by CYP2C19 (e.g. fluoxetine, paroxetine). Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Escitalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate escitalopram therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Escitalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate escitalopram therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Escitalopram",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Consider an alternative SSRI not metabolized by CYP2C19 (e.g. fluoxetine, paroxetine). If escitalopram is warranted, monitor closely for symptom resolution and adjust escitalopram dose up to a maximum of 150%of the standard dosing guideline due to increased drug clearance and reduced drug efficacy. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Esomeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Initiate esomeprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Esomeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate esomeprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Esomeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate esomeprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Esomeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19 and may experience increased drug clearance and reduced drug efficacy. Be alert to insufficient response to proton pump inhibitors. An alternative therapeutic class such as H2-blockers is recommended.  If esomeprazole is warranted, consider a dose increase by 50-100% of the recommended dosing guideline. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial imipramine dosing by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate imipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate imipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Imipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer of CYPC19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If imipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Lansoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19 and may experience increased drug clearance and reduced drug efficacy. Be alert to insufficient response to proton pump inhibitors. An alternative therapeutic class such as H2-blockers is recommended.  If lansoprazole is warranted, consider a dose increase by 200% of the recommended dosing guideline. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Lansoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate lansoprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Lansoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate lansoprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Lansoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Initiate lansoprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Omeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Initiate omeprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Omeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate omeprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Omeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate omeprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Omeprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19 and may experience increased drug clearance and reduced drug efficacy. Be alert to insufficient response to proton pump inhibitors. An alternative therapeutic class such as H2-blockers is recommended.  If omeprazole is warranted, consider a dose increase by 100% - 200% of the recommended dosing guideline. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Pantoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. A dose reduction in pantoprazole should be considered. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Pantoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate pantoprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Pantoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate pantoprazole therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Pantoprazole",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19 and may experience increased drug clearance and reduced drug efficacy. Be alert to insufficient response to proton pump inhibitors. An alternative therapeutic class such as H2-blockers is recommended. If pantoprazole is warranted, consider a dose increase by 400% of the recommended dosing guideline. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Sertraline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2C19. Select alternative drug not predominantly metabolized by CYP2C19 (e.g. sertraline). If sertraline is warranted, consider reducing initial sertraline dose by 50 % of the standard dosing guideline.  Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Sertraline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate sertraline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Sertraline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate sertraline therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.  "
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Sertraline",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a ultrarapid metabolizer for CYP2C19 and may experience increased drug clearance and reduced drug efficacy with sertraline. Initiate sertraline therapy per standard dosing guidelines, but  be alert to insufficient response. If patient does not respond to recommended maintenance dosing, consider alternative drug not predominantly metabolized by CYP2C19 (e.g. paroxetine). Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a poor metabolizer for CYP2C19. Consider reducing initial trimipramine dosing by 50 % of the standard dosing guideline. Monitor closely for adverse drug reactions and symptom resolution due to reduced drug clearance. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a intermediate metabolizer for CYP2C19. Initiate trimipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state.   "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate trimipramine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Trimipramine",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [
                "23486447"
            ],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Consider an alternative tricyclic antidepressant not metabolized by CYP2C19 (e.g. desipramine, maprotiline). If trimipramine is warranted, monitor closely for symptom resolution due to increased drug clearance and reduced drug efficacy.  Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Carisoprodol",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate carisoprodol therapy per standard dosing guidelines.  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Carisoprodol",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate carisoprodol therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Carisoprodol",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2C19. Initiate carisoprodol therapy per standard dosing guidelines. Carisoprodol should be used with caution due to a 4-fold increase in exposure to carisoprodol and a 50% decreased exposure to meprobamate (a metabolite of carisoprodol).  Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Carisoprodol",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Initiate carisoprodol therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Clobazam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2C19. Concentrations of clobazam's active metabolite, N-desmethylclobazam, are higher in CYP2C19 poor metabolizers than in normal metabolizers. For this reason, the initial dose should be 5 mg/day. Subsequent doses should be adjusted according to response to therapy and disease state and titrated initially to 10-20 mg/day, with a  further titration to a maximum daily dose of 40 mg if tolerated."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Clobazam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate clobazam therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Clobazam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate clobazam therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Clobazam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Initiate clobazam therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Diazepam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a poor metabolizer for CYP2C19. Initiate diazepam therapy per standard dosing guidelines. Poor metabolizers may have increased metabolism of diazepam and may emerge from anesthesia less rapidly. Other genetic and clinical factors may also influence metabolism of diazepam.  Adjust diazepam dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Diazepam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an intermediate metabolizer for CYP2C19. Initiate diazepam therapy per standard dosing guidelines. Intermediate metabolizers may have increased metabolism of diazepam and may emerge from anesthesia less rapidly. Other genetic and clinical factors may also influence metabolism of diazepam.  Adjust diazepam dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Diazepam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is a normal metabolizer for CYP2C19. Initiate diazepam therapy per standard dosing guidelines.  Adjust diazepam dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Ultrarapid Metabolizer"
            ],
            "drug": "Diazepam",
            "genes": [
                "CYP2C19"
            ],
            "pubmed": [],
            "rec": "The patient is an ultrarapid metabolizer for CYP2C19. Initiate diazepam therapy per standard dosing guidelines.  Adjust diazepam dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Bupropion",
            "genes": [
                "ANKK1"
            ],
            "pubmed": [
                "18058343",
                "17654295",
                "15492764"
            ],
            "rec": "This patient has a favourable genotype in regards to smoking cessation therapy with bupropion. Patients with this genotype who are treated with bupropion may be more likely to quit smoking as compared to patients without this genotype. Other clinical and genetic factors may influence outcomes.   Adjust bupropion dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Bupropion",
            "genes": [
                "ANKK1"
            ],
            "pubmed": [
                "18058343",
                "17654295",
                "15492764"
            ],
            "rec": "This patient has an unfavourable genotype in regards to smoking cessation therapy with bupropion. Patients with this genotype who are treated with bupropion may be less likely to quit smoking as compared to patients without this genotype. Other clinical and genetic factors may influence outcomes.   Adjust bupropion dose based upon patient response to therapy and clinical judgment."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Azathioprine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is a normal metabolizer for TPMT. Initiate azathioprine therapy per disease-specific dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. Allow 2 weeks to reach steady state after each dose adjustment."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Azathioprine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is an intermediate metabolizer for TPMT and has reduced ability to metabolize azathioprine. Initiate azathioprine therapy by reducing dose by 50% (30% - 70%) of disease-specific dosing guidelines. Subsequent doses should be adjusted to response of hematologic monitoring and efficacy. Allow 2-4 weeks to reach steady state after each dose adjustment."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Azathioprine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is a poor metabolizer for TPMT and has reduced to no ability to metabolize azathioprine. Consider alternative agents whenever possible. If azathioprine therapy is warranted, initiate azathioprine therapy by reducing dose by 90% of disease-specific dosing guidelines. Subsequent doses should be adjusted according to the degree of myelosuppression and disease-specific guidelines. Allow 4-6 weeks to reach steady state after each dose adjustment. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Mercaptopurine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is a normal metabolizer for TPMT. Initiate mercaptopurine therapy per disease-specific dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. Allow 2 weeks to reach steady state after each dose adjustment."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Mercaptopurine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is an intermediate metabolizer for TPMT and has reduced ability to metabolize mercaptopurine. Initiate mercaptopurine therapy by reducing dose by 50% (30% - 70%) of disease-specific dosing guidelines. Subsequent doses should be adjusted to response of myelosuppresion and efficacy. In setting of myelosuppression, and depending on other therapy, emphasis should be on reducing mercaptopurine over other agents. Allow 2-4 weeks to reach steady state after each dose adjustment. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Mercaptopurine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is a poor metabolizer for TPMT and has reduced to no ability to metabolize mercaptopurine. For malignancy, initiate therapy by reducing dose by 90% of disease-specific dosing guidelines and reduce frequency to thrice weekly instead of daily and adjust mercaptopurine dose based on degree of myelosuppression and disease-specific guidelines. Allow 4-6 weeks to reach steady state after each dose adjustment. In setting of myelosuppression, emphasis should be on reducing mercaptopurine over other agents. For non-malignant conditions, consider alternative nonthiopurine immunosuppressant therapy. "
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Thioguanine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is a normal metabolizer for TPMT. Initiate usual thioguanine therapy per disease-specific dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. Allow 2 weeks to reach steady state after each dose adjustment."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Thioguanine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is an intermediate metabolizer for TPMT and has reduced ability to metabolize thioguanine. Initiate thioguanine therapy by reducing dose by 30% - 50% of disease-specific dosing guidelines. Subsequent doses should be adjusted to response of myelosuppresion and efficacy. In setting of myelosuppression, and depending on other therapy, emphasis should be on reducing thioguanine over other agents. Allow 2-4 weeks to reach steady state after each dose adjustment. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Thioguanine",
            "genes": [
                "TPMT"
            ],
            "pubmed": [
                "21270794"
            ],
            "rec": "The patient is a poor metabolizer for TPMT and has reduced to no ability to metabolize thioguanine. For malignancy, initiate therapy by reducing dose by 90% of disease-specific dosing guidelines and adjust thioguanine dose based on degree of myelosuppression and disease-specific guidelines. Allow 4-6 weeks to reach steady state after each dose adjustment. In setting of myelosuppression, emphasis should be on reducing thioguanine over other agents. For non-malignant conditions, consider alternative nonthiopurine immunosuppressant therapy."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Boceprevir",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a favourable phenotype with regards to boceprevir treatment for HCV. Patient has approximately a 90% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 80-90% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Boceprevir",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a unfavourable phenotype with regards to boceprevir treatment for HCV. Patient has approximately a 60% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment)after 24-48 weeks of treatment. Approximately 50% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Peginterferon-alfa-2a",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a favourable genotype with regards to peginterferon-alfa-2a treatment for HCV.  The patient has approximately a 90% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment)  after 24-48 weeks of treatment. Approximately 80-90% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Peginterferon-alfa-2a",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a unfavourable genotype with regards to peginterferon-alfa-2a treatment for HCV. Patient has approximately a 60% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 50% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Ribavirin",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a favourable genotype with regards to ribavirin treatment for HCV.  The patient has approximately a 90% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 80-90% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Ribavirin",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a unfavourable genotype with regards to ribavirin treatment for HCV. Patient has approximately a 60% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 50% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Telaprevir",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a favourable genotype with regards to telaprevir treatment for HCV.  The patient has approximately a 90% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 80-90% of patients are eligible for shortened therapy. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Telaprevir",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a unfavourable genotype with regards to telaprevir treatment for HCV. Patient has approximately a 60% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 50% of patients are eligible for shortened therapy. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Peginterferon-alfa-2b",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a favourable genotype with regards to peginterferon-alfa-2b treatment for HCV.  The patient has approximately a 90% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 80-90% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Peginterferon-alfa-2b",
            "genes": [
                "IFNL3"
            ],
            "pubmed": [
                "24096968"
            ],
            "rec": "The patient has a unfavourable genotype with regards to peginterferon-alfa-2b treatment for HCV. Patient has approximately a 60% chance for sustained virologic response (defined by undetectable serum viral RNA 12-24 weeks after the end of treatment) after 24-48 weeks of treatment. Approximately 50% of patients are eligible for shortened therapy. Patients receiving boceprevir are eligible for 24-28 weeks instead of the standard 48 weeks if HCV RNA is undetectable by week eight. Patients receiving telaprevir are eligible for 24 weeks of therapy instead of the standard 48 weeks if HCV RNA is undetectable by week four."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Capecitabine",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873"
            ],
            "rec": "The patient is a normal metabolizer for DYPD.  Initiate capecitabine therapy per disease-specific dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Capecitabine",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873"
            ],
            "rec": "This patient is a intermediate metabolizer for DPYD and is at increased risk for severe or even fatal drug toxicity when treated with fluoropyrimidine drugs, due to reduced drug clearance. Initiate capecitabine therapy by reducing dose by at least 50% of disease-specific dosing guidelines followed by titration of dose based on toxicity and efficacy. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Capecitabine",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873"
            ],
            "rec": "This patient is a poor metabolizer for DPYD.  Select an alternate drug. The patient has complete DPD deficiency and is at an increased risk for severe or even fatal drug toxicity when treated with fluoropyrimidine drugs."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Fluorouracil",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873",
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for DYPD. Initiate fluorouracil therapy per disease-specific dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Fluorouracil",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873",
                "21412232"
            ],
            "rec": "This patient is a intermediate metabolizer for DPYD and is at increased risk for severe or even fatal drug toxicity when treated with fluoropyrimidine drugs, due to reduced drug clearance. Initiate fluorouracil therapy by reducing dose by at least 50% of disease-specific dosing guidelines followed by titration of dose based on toxicity and efficacy. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Fluorouracil",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873",
                "21412232"
            ],
            "rec": "This patient is a poor metabolizer for DPYD.  Select an alternate drug. The patient has a complete DPD deficiency and increased risk for severe or even fatal drug toxicity when treated with fluoropyrimidine drugs."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Tegafur",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873",
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for DYPD. Initiate tegafur therapy per disease-specific dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Tegafur",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873",
                "21412232"
            ],
            "rec": "This patient is a intermediate metabolizer for DPYD and is at increased risk for severe or even fatal drug toxicity when treated with fluoropyrimidine drugs, due to reduced drug clearance. Initiate tegafur therapy by reducing dose by at least 50% of disease-specific dosing guidelines followed by titration of dose based on toxicity and efficacy. "
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Tegafur",
            "genes": [
                "DPYD"
            ],
            "pubmed": [
                "23988873",
                "21412232"
            ],
            "rec": "This patient is a poor metabolizer for DPYD. Select an alternate drug. The patient has complete DPD deficiency and increased risk for severe or even fatal drug toxicity when treated with fluoropyrimidine drugs."
        },
        {
            "classes": [
                "High Risk"
            ],
            "drug": "Carbamazepine",
            "genes": [
                "HLA-B*15:02"
            ],
            "pubmed": [
                "23695185"
            ],
            "rec": "The patient is an HLA-B*15:02 allele carrier. Carbamazepine is not recommended due to significantly increased risk to develop carbamazepine-associated cutaneous adverse reactions and alternative medications should be used as first-line therapy. The risk for HLA-B*15:02 carriers to develop significant hypersensitivity reactions  is approximately 7%. Consideration in the choice of alternative medications should be given to the possibility of cross-reactivity with structurally similar antiepileptics such as oxcarbazepine, lamotrigine, phenytoin, phenobarbital and primidone. If patient has previously used carbamazepine for longer than 3 months without incidence of cutaneous adverse reactions, cautiously consider use of carbamazepine per standard dosing guidelines."
        },
        {
            "classes": [
                "Low Risk"
            ],
            "drug": "Carbamazepine",
            "genes": [
                "HLA-B*15:02"
            ],
            "pubmed": [
                "23695185"
            ],
            "rec": "The patient does not carry the HLA-B*15:02 allele. Initiate carbamazepine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "High Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "HLA-B*15:02"
            ],
            "pubmed": [],
            "rec": "The patient is an  HLA-B*15:02 allele carrier and is at increased risk to develop phenytoin associated severe cutaneous reactions such as Stevens-Johnson syndrome (SJS) and toxic epidermal necrolysis (TEN). Consideration should be given to avoiding phenytoin or carbamazepine in patients positive for HLA-B*1502. It is recommended to consider using an anticonvulsant other than phenytoin and carbamazepine unless the benefits of treating the underlying disease clearly outweigh the risks. Alternative medications such as oxcarbazepine, eslicarbazepine acetate, and lamotrigine have some evidence linking SJS/TEN with the HLA-B*15:02 allele and thus caution should be used in choosing alternatives to phenytoin."
        },
        {
            "classes": [
                "Low Risk"
            ],
            "drug": "Phenytoin",
            "genes": [
                "HLA-B*15:02"
            ],
            "pubmed": [],
            "rec": "The patient does not carry the  HLA-B*15:02 allele. Initiate phenytoin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to therapeutic drug monitoring and response to therapy. "
        },
        {
            "classes": [
                "High Risk"
            ],
            "drug": "Carbamazepine",
            "genes": [
                "HLA-A*31:01"
            ],
            "pubmed": [
                "24597466"
            ],
            "rec": "The patient is an HLA-A*31:01 allele carrier. Carbamazepine is not recommended due to significantly increased risk to develop carbamazepine-induced hypersensitivity reactions and alternative medications should be used as first-line therapy. Consideration in the choice of alternative medications should be given to the possibility of cross-reactivity with structurally similar antiepileptics such as oxcarbazepine, lamotrigine, phenytoin, phenobarbital and primidone. If patient has previously used carbamazepine for longer than 3 months without incidence of cutaneous adverse reactions, cautiously consider use of carbamazepine per standard dosing guidelines."
        },
        {
            "classes": [
                "Low Risk"
            ],
            "drug": "Carbamazepine",
            "genes": [
                "HLA-A*31:01"
            ],
            "pubmed": [
                "24597466"
            ],
            "rec": "The patient does not carry the  HLA-B*31:01 allele. Initiate carbamazepine therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state."
        },
        {
            "classes": [
                "Normal Transporter Activity"
            ],
            "drug": "Simvastatin",
            "genes": [
                "SLCO1B1"
            ],
            "pubmed": [
                "22617227"
            ],
            "rec": "The patient has normal population risk for developing simvastatin-related muscle toxicity based on SLCO1B1 genotype. Other factors known to influence a patient's risk for developing statin-induced muscle toxicity include increased statin dose, advanced age, small body mass index, female gender, metabolic comorbidities (e.g., hypothyroidism), intense physical exercise, and Asian or African ancestry. Initiate simvastatin therapy per standard dosing guidelines. Subsequent doses should be adjusted according to response to therapy and disease state. "
        },
        {
            "classes": [
                "Intermediate Transporter Activity"
            ],
            "drug": "Simvastatin",
            "genes": [
                "SLCO1B1"
            ],
            "pubmed": [
                "22617227"
            ],
            "rec": "The patient has an increased risk for simvastatin-related muscle toxicity based on SLCO1B1 genotype. Other factors can additionally influence a patient's risk for developing statin-induced muscle toxicity which includes increased statin dose, advanced age, small body mass index, female gender, metabolic comorbidities (e.g., hypothyroidism), intense physical exercise, and Asian or African ancestry. An alternative statin (e.g. atorvastatin, pitavastatin, pravastatin, rosuvastatin) is recommended. If simvastatin is warranted, consider initiating therapy at a lower dose.  Adjust simvastatin dose based upon patient response to therapy, CK surveillance, and disease state."
        },
        {
            "classes": [
                "Poor Transporter Activity"
            ],
            "drug": "Simvastatin",
            "genes": [
                "SLCO1B1"
            ],
            "pubmed": [
                "22617227"
            ],
            "rec": "The patient has an increased risk for simvastatin-related rhabdomyolysis based on SLCO1B1 genotype.  Other factors can additionally influence a patient's risk for developing statin-induced muscle toxicity which includes increased statin dose, advanced age, small body mass index, female gender, metabolic comorbidities (e.g., hypothyroidism), intense physical exercise, and Asian or African ancestry. An alternative statin (e.g. atorvastatin, pitavastatin, pravastatin, rosuvastatin) is recommended. If simvastatin is warranted, consider initiating therapy at a lower dose.  Adjust simvastatin dose based upon patient response to therapy, CK surveillance, and disease state."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP4F2"
            ],
            "pubmed": [],
            "rec": "The patient may require a lower dose of warfarin as compared to the other CYP4F2 genotypes. Other genetic and clinical factors may also influence a patient's required warfarin dose. Adjust warfarin dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP4F2"
            ],
            "pubmed": [],
            "rec": "The patient may require a higher dose of warfarin as compared to patients with the other CYP4F2 genotypes. Other genetic and clinical factors may also influence a patient's required warfarin dose. Adjust warfarin dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Warfarin",
            "genes": [
                "CYP4F2"
            ],
            "pubmed": [],
            "rec": "The patient may require a higher dose of warfarin as compared to patients with the other CYP4F2 genotypes. Other genetic and clinical factors may also influence a patient's required warfarin dose. Adjust warfarin dose according to the INR, response to therapy and disease state."
        },
        {
            "classes": [
                "Favourable Response"
            ],
            "drug": "Citalopram",
            "genes": [
                "GRIK4"
            ],
            "pubmed": [],
            "rec": "The patient may have an increased chance of response to citalopram treatment based on GRIK4 genotype. However, the patient may still be at risk for non-response to citalopram treatment. Other genetic and clinical factors may also influence chance of responding."
        },
        {
            "classes": [
                "Unfavourable Response"
            ],
            "drug": "Citalopram",
            "genes": [
                "GRIK4"
            ],
            "pubmed": [],
            "rec": "The patient may have a decreased chance of response to citalopram treatment based on GRIK4 genotype. Other genetic and clinical factors may also influence chance of responding."
        },
        {
            "classes": [
                "Normal Metabolizer"
            ],
            "drug": "Tacrolimus",
            "genes": [
                "CYP3A5"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP3A5. Initiate taccrolimus therapy with an increase of 1.5 to 2 times of the recommended starting dose. Total starting dose should not exceed 0.3mg/kg/day. Subsequent doses should be adjusted according to therapeutic drug monitoring, response to therapy and disease state."
        },
        {
            "classes": [
                "Intermediate Metabolizer"
            ],
            "drug": "Tacrolimus",
            "genes": [
                "CYP3A5"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a normal metabolizer for CYP3A5. Initiate taccrolimus therapy with an increase of 1.5 to 2 times of the recommended starting dose. Total starting dose should not exceed 0.3mg/kg/day. Subsequent doses should be adjusted according to therapeutic drug monitoring, response to therapy and disease state."
        },
        {
            "classes": [
                "Poor Metabolizer"
            ],
            "drug": "Tacrolimus",
            "genes": [
                "CYP3A5"
            ],
            "pubmed": [
                "21412232"
            ],
            "rec": "The patient is a poor metabolizer for CYP3A5. Initiate tacrolimus therapy per recommended dosing guidelines. Subsequent doses should be adjusted according to therapeutic drug monitoring, response to therapy and disease state."
        }
    ]
}