[
    {
        "FR_ID": "1",
        "Gene": "cyp2d6",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has reduced or no metabolism of CYP2D6 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. atomoxetine, ondansetron, propafenone, tamoxifen, tricyclic antidepressants) OR lack of drug effectiveness from failure to produce the active form of the drug (e.g. codeine, hydrocodone, oxycodone, tramadol). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
    },
    {
        "FR_ID": "2",
        "Gene": "cyp2d6",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has reduced metabolism of CYP2D6 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. atomoxetine, ondansetron, propafenone, tamoxifen, tricyclic antidepressants) OR lack of drug effectiveness from failure to produce sufficient amount of the active form of the drug (e.g. codeine, hydrocodone, oxycodone, tramadol). Be aware of potential need for dose adjustments."
    },
    {
        "FR_ID": "3",
        "Gene": "cyp2d6",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize CYP2D6 substrate drugs as expected (e.g. atomoxetine, ondansetron, opioids, propafenone, tamoxifen, tricyclic antidepressants)."
    },
    {
        "FR_ID": "4",
        "Gene": "cyp2d6",
        "Therapeutic_Class": "Ultrarapid Metabolizer",
        "rec": "Patient has higher than average CYP2D6 substrate drug metabolism, leading to reduced drug effectiveness (e.g. atomoxetine, ondansetron, propafenone, tamoxifen, tricyclic antidepressants) OR increased risk of adverse drug reactions due to increased exposure to active drug metabolites (codeine, hydrocodone, oxycodone, tramadol). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
    },
    {
        "FR_ID": "5",
        "Gene": "cyp2c19",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has reduced or no metabolism of CYP2C19 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. tricyclic antidepressants) OR lack of drug effectiveness from failure to produce the active form of the drug (e.g. clopidogrel). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
    },
    {
        "FR_ID": "6",
        "Gene": "cyp2c19",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has reduced metabolism of CYP2C19 substrate drugs, leading to an increased risk of adverse drug reactions (e.g. tricyclic antidepressants) OR lack of drug effectiveness from failure to produce sufficien amount of the active form of the drug (e.g. clopidogrel). Be aware of potential need for dose adjustments and/or avoid these medications whenever possible."
    },
    {
        "FR_ID": "7",
        "Gene": "cyp2c19",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize CYP2C19 substrate drugs as expected (e.g. citalopram, clopidogrel, tricyclic antidepressants)."
    },
    {
        "FR_ID": "8",
        "Gene": "cyp2c19",
        "Therapeutic_Class": "Ultrarapid Metabolizer",
        "rec": "Patient has higher than average CYP2C19 substrate drug metabolism, leading to reduced drug efficacy (e.g.  Citalopram, escitalopram, proton pump inhibitors, tricyclic antidepressants). Be aware of significant need for dose adjustments and/or avoid these medications whenever possible."
    },
    {
        "FR_ID": "9",
        "Gene": "cyp2c9",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize CYP2C9 substrate drugs (e.g. celecoxib, phenytoin) as expected."
    },
    {
        "FR_ID": "10",
        "Gene": "cyp2c9",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has reduced metabolism of CYP2C9 substrate drugs, leading to an increased risk of adverse drug reactions (e.g.  phenytoin), dose adjustments of phenytoin maintenance therapy may be necessary."
    },
    {
        "FR_ID": "11",
        "Gene": "cyp2c9",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has reduced to no ability to metabolize CYP2C9 subtrate drugs (e.g. celecoxib, phenytoin), leading to an increased risk of adverse drug reactions.  Dose adjustments may be necessary."
    },
    {
        "FR_ID": "12",
        "Gene": "abcb1",
        "Therapeutic_Class": "Favorable Response",
        "rec": "Patient will have expected exposure and pharmacodynamics of ABCB1 substrate drugs (e.g. digoxin, morphine, tacrolimus)."
    },
    {
        "FR_ID": "13",
        "Gene": "abcb1",
        "Therapeutic_Class": "Unfavorable Response",
        "rec": "Patient may have increased systemic exposure and altered pharmacodynamics of ABCB1 substrate drugs (e.g. digoxin, morphine, tacrolimus)."
    },
    {
        "FR_ID": "14",
        "Gene": "abcg2",
        "Therapeutic_Class": "Favorable Response",
        "rec": "Patient will have expected exposure and pharmacodynamics of ABCG2 substrate drugs (e.g. methotrexate, statins)."
    },
    {
        "FR_ID": "15",
        "Gene": "abcg2",
        "Therapeutic_Class": "Unfavorable Response",
        "rec": "Patient may have increased systemic exposure and altered pharmacodynamics of ABCG2 substrate drugs (e.g. methotrexate, statins)."
    },
    {
        "FR_ID": "16",
        "Gene": "ankk1",
        "Therapeutic_Class": "High Risk",
        "rec": "Patient may have an increased risk for tardive dyskinesia while on treatment with second generation antipsychotics."
    },
    {
        "FR_ID": "17",
        "Gene": "ankk1",
        "Therapeutic_Class": "Normal Risk",
        "rec": "Patient has a lower risk for tardive dyskinesia while on treatment with second generation antipsychotics compared to the normal population risk."
    },
    {
        "FR_ID": "18",
        "Gene": "comt",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize COMT substrate drugs (e.g. antispsychotics, cisplatin, opioids) as expected."
    },
    {
        "FR_ID": "19",
        "Gene": "comt",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has reduced ability to metabolize COMT subtrate drugs (e.g. antispsychotics, cisplatin, opioids), leading to an increased risk of adverse drug reactions.  Dose adjustments may be necessary."
    },
    {
        "FR_ID": "20",
        "Gene": "comt",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has reduced to no ability to metabolize COMT subtrate drugs (e.g. antispsychotics, cisplatin, opioids), leading to an increased risk of adverse drug reactions.  Dose adjustments may be necessary."
    },
    {
        "FR_ID": "21",
        "Gene": "dpyd",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will  metabolize DPYD subtrate drugs (e.g. capecitabine, fluorouracil, tegafur) as expected."
    },
    {
        "FR_ID": "22",
        "Gene": "dpyd",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient will have reduced ability to metabolize DPYD substrate drugs (e.g. capecitabine, fluorouracil, tegafur) and may be at increased risk for fluoropyrimidine toxicity.  Dose adjustements are indicated."
    },
    {
        "FR_ID": "23",
        "Gene": "dpyd",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient will have reduced to no ability to metabolize DPYD substrate drugs (e.g. capecitabine, fluorouracil, tegafur) and are at increased risk for severe or even fatal fluoropyrimidine toxicity. Dose adjustements are indicated."
    },
    {
        "FR_ID": "24",
        "Gene": "grik4",
        "Therapeutic_Class": "Favorable Response",
        "rec": "Patient may respond favorably to citalopram therapy when used for treatment of depression."
    },
    {
        "FR_ID": "25",
        "Gene": "grik4",
        "Therapeutic_Class": "Unfavorable Response",
        "rec": "Patient may respond less favorably to citalopram therapy when used for treatment of depression."
    },
    {
        "FR_ID": "26",
        "Gene": "hla-a*31:01",
        "Therapeutic_Class": "High Risk",
        "rec": "Patient should avoid use of carbamazepine due to increased risk for carbamazepine associated hypersensitivity syndromes and severe cutaneous reactions."
    },
    {
        "FR_ID": "27",
        "Gene": "hla-b*15:02",
        "Therapeutic_Class": "High Risk",
        "rec": "Patient should avoid use of carbamazepine and phenytoin due to increased risk for severe cutaneous hypersensitivity reactions. Consider the possibility of cross-reactivity with structurally simiar antiepileptic drugs (e.g. oxcarbazepine, lamotrigine, phenytoin, phenobarbital, primidone)."
    },
    {
        "FR_ID": "28",
        "Gene": "hla-b*57:01",
        "Therapeutic_Class": "High Risk",
        "rec": "Patient should avoid use of abacavir due to significantly increased risk of abacavir hypersensitivity reactions."
    },
    {
        "FR_ID": "29",
        "Gene": "hla-a*31:01",
        "Therapeutic_Class": "Normal Risk (*31:01 absent)",
        "rec": "Patient has normal population risk for carbamazepine associated hypersensitivity syndromes and severe cutaneous reactions."
    },
    {
        "FR_ID": "30",
        "Gene": "hla-b*15:02",
        "Therapeutic_Class": "Normal Risk (*15:02 absent)",
        "rec": "Patient has normal population risk for carbamazepine and phenytoin associated severe cutaneous hypersensitivity reactions."
    },
    {
        "FR_ID": "31",
        "Gene": "hla-b*57:01",
        "Therapeutic_Class": "Normal Risk (*57:01 absent)",
        "rec": "Patient has normal population risk for abacavir hypersensitivity reactions."
    },
    {
        "FR_ID": "32",
        "Gene": "ifnl3",
        "Therapeutic_Class": "Favorable Response",
        "rec": "Patient may have increased eligibility for shortened treatment with peginterferon alfa 2a/2b, ribavirin, and protease inhibitor treatment."
    },
    {
        "FR_ID": "33",
        "Gene": "ifnl3",
        "Therapeutic_Class": "Unfavorable Response",
        "rec": "Patient may have reduced eligibility for shortened treatment with peginterferon alfa 2a/2b, ribavirin, and protease inhibitor treatment."
    },
    {
        "FR_ID": "34",
        "Gene": "mthfr",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize MTHFR substrate drugs (e.g. methotrexate) as expected and has a normal population risk for adverse drug reactions."
    },
    {
        "FR_ID": "35",
        "Gene": "mthfr",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient may have a reduced ability to metabolize MTHFR substrate drugs (e.g. methotrexate) and is at an increased risk of adverse drug reactions."
    },
    {
        "FR_ID": "36",
        "Gene": "slco1b1",
        "Therapeutic_Class": "High Risk",
        "rec": "Patient has an increased risk for simvastatin-related rhabdomyolysis, use of other statins (e.g. atorvastatin, pitavastatin, pravastatin, rosuvastatin) is recommended when possible."
    },
    {
        "FR_ID": "37",
        "Gene": "slco1b1",
        "Therapeutic_Class": "Intermediate Risk",
        "rec": "Patient has an increased risk for simvastatin-related rhabdomyolysis, use of other statins (e.g. atorvastatin, pitavastatin, pravastatin, rosuvastatin) is recommended when possible."
    },
    {
        "FR_ID": "38",
        "Gene": "slco1b1",
        "Therapeutic_Class": "Normal Risk",
        "rec": "Patient has normal population risk for simvastatin-related rhabdomyolysis."
    },
    {
        "FR_ID": "39",
        "Gene": "slc19a1",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient has a normal population risk for developing toxic liver disease and other adverse drug reactions when treated with leucovorin, mercaptopurine and methotrexate."
    },
    {
        "FR_ID": "40",
        "Gene": "slc19a1",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has an increased risk for developing toxic liver disease and other adverse drug reactions when treated with leucovorin, mercaptopurine and methotrexate."
    },
    {
        "FR_ID": "41",
        "Gene": "tmem43/xpc",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient has normal population risk for ototoxicity and neutropenia in response to cisplatin therapy."
    },
    {
        "FR_ID": "42",
        "Gene": "tmem43/xpc",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has an increased risk for ototoxicity and neutropenia in response to cisplatin therapy."
    },
    {
        "FR_ID": "43",
        "Gene": "tpmt",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize thiopurines (e.g. azathioprine, 6-mercaptopurine, thioguanine) as expected."
    },
    {
        "FR_ID": "44",
        "Gene": "tpmt",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has reduced ability to metabolize thiopurines (e.g. azathioprine, 6-mercaptopurine, thioguanine) due to decreased TPMT activity and is at an increased an risk of myelosuppression. Dose reduction is indicated."
    },
    {
        "FR_ID": "45",
        "Gene": "tpmt",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has reduced to no ability to metabolize thiopurines (e.g. azathioprine, 6-mercaptopurine, thioguanine) due to decreased to no TPMT activity and is at an increased an risk of myelosuppression. Significant dose reduction is indicated."
    },
    {
        "FR_ID": "46",
        "Gene": "vkorc1",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient has expected conversion of vitamin K. This can have implications for warfarin dosing."
    },
    {
        "FR_ID": "47",
        "Gene": "vkorc1",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has lower than normal conversion of vitamin K. This can have implications for warfarin dosing."
    },
    {
        "FR_ID": "48",
        "Gene": "vkorc1",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has lower than normal conversion of vitamin K. This can have implications for warfarin dosing."
    },
    {
        "FR_ID": "49",
        "Gene": "cyp4f2",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will inactivate vitamin K as expected. This has implications for warfarin dosing."
    },
    {
        "FR_ID": "50",
        "Gene": "cyp4f2",
        "Therapeutic_Class": "Intermediate Metabolizer",
        "rec": "Patient has reduced ability to inactivate vitamin K. This has implications for warfarin dosing."
    },
    {
        "FR_ID": "51",
        "Gene": "cyp4f2",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient has reduced ability to inactivate vitamin K. This has implications for warfarin dosing."
    },
    {
        "FR_ID": "52",
        "Gene": "cyp3a5",
        "Therapeutic_Class": "Normal Metabolizer",
        "rec": "Patient will metabolize CYP3A5 substrate drugs (e.g. tacrolimus) as expected."
    },
    {
        "FR_ID": "53",
        "Gene": "cyp3a5",
        "Therapeutic_Class": "Poor Metabolizer",
        "rec": "Patient may have a reduced ability to metabolize CYP3A5 substrate drugs (e.g. tacrolimus) and may require dose adjustments."
    }
]